/*
Выведите таблицу со средними оценками студентов группы 4100 (Номер, ФИО, Ср_оценка), 
у которых средняя оценка больше средней оценк(е|и) в группе 3100
*/


WITH СР_ОЦЕНКА_3100 as (
	SELECT
		AVG(Н_ВЕДОМОСТИ.ОЦЕНКА::INTEGER) as СР_ОЦЕНКА
	FROM Н_ЛЮДИ
	INNER JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
	INNER JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
	WHERE Н_УЧЕНИКИ.ГРУППА = '3100' AND Н_ВЕДОМОСТИ.ОЦЕНКА IN ('2', '3', '4', '5')
)
SELECT 
	Н_ЛЮДИ.ИД,
	CONCAT(Н_ЛЮДИ.ФАМИЛИЯ, ' ', Н_ЛЮДИ.ИМЯ, ' ', Н_ЛЮДИ.ОТЧЕСТВО) AS ФИО,
	AVG(Н_ВЕДОМОСТИ.ОЦЕНКА::INTEGER) as СР_ОЦЕНКА
FROM Н_ЛЮДИ
	INNER JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
	INNER JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
	CROSS JOIN СР_ОЦЕНКА_3100
WHERE Н_УЧЕНИКИ.ГРУППА = '4100' AND Н_ВЕДОМОСТИ.ОЦЕНКА IN ('2', '3', '4', '5')
GROUP BY Н_ЛЮДИ.ИД, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, СР_ОЦЕНКА_3100.СР_ОЦЕНКА
HAVING AVG(Н_ВЕДОМОСТИ.ОЦЕНКА::INTEGER) > СР_ОЦЕНКА_3100.СР_ОЦЕНКА;
